const coaches = {
  "Ефремова Александра Игоревна": {
    active: true,
    lead: true,
    name: "Ефремова Александра Игоревна",
    shortname: "Ефремова А.И.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild6337-3537-4337-a663-333466666462/_1.png",
    contacts: [null, null],
    arenas: ["Репино", "Рубеж"],
    description: [
      "Родилась в Санкт-Петербурге, занималась одиночным и синхронным катанием.\n\nВ составе команды синхронного катания «Парадиз» – чемпион России, победитель этапов и финала Кубка России. Мастер спорта России.\n\nНачиная с сезона 2017-2018 гг., работает тренером в школе «Голден Айс». Ученики Александры Игоревны в течение последних лет выполнили множество спортивных разрядов и выиграли десятки медалей в различных соревнованиях в Санкт-Петербурге и Ленинградской области.",
    ],
  },
  "Жунгиету Юлия Игоревна": {
    active: true,
    lead: true,
    name: "Жунгиету Юлия Игоревна",
    shortname: "Жунгиету Ю.И.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3231-3538-4266-a137-396564333639/_1.png",
    contacts: [null, null],
    arenas: ["Репино", "Шанс"],
    description: [
      "Родилась в г.Севастополь, занималась одиночным катанием, выполнила разряд КМС. " +
        "Победитель и призёр региональных соревнований. " +
        "В сезонах 2014-2015, 2015-2016 гг. – работала тренером в г. Севастополь. " +
        "Начиная с сезона 2016-2017 гг., работает тренером в спортивной школе «Голден Айс». " +
        "Ученики Юлии Игоревны выполняют юношеские и спортивные разряды, выигрывают медали в крупнейших соревнованиях города и области.",
    ],
  },
  "Карнизов Александр Владимирович": {
    active: true,
    lead: true,
    name: "Карнизов Александр Владимирович",
    shortname: "Карнизов А.В.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3839-6532-4933-a235-376662383936/_1.png",
    contacts: [null, null],
    arenas: ["Стрельна", "Рубеж"],
    description: [
      "Родился в г. Оленегорск Мурманской области, занимался одиночным катанием, представлял Мурманскую область и Санкт-Петербург на основных всероссийских соревнованиях.\n\nУчастник Этапов Кубка России и Финала Спартакиады. Мастер спорта России.\nНачиная с сезона 2010-2011 гг., работал тренером в Республике Татарстан, Удмуртской Республике и Республике Мордовия. Воспитал участников основных всероссийских соревнований, двух мастеров спорта.\n\nНачиная с сезона 2023-2024 гг., работает тренером в Санкт-Петербурге, в спортивной школе «Голден Айс».",
    ],
  },
  "Петрова Евгения Васильевна": {
    active: true,
    lead: true,
    name: "Петрова Евгения Васильевна",
    shortname: "Петрова Е.В.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3565-6335-4661-b766-336662333866/photo.png",
    contacts: ["+7 (911) 001 43-33", "evgsalt.2108@gmail.com"],
    arenas: ["Репино", "Красная звезда"],
    description: [
      "Родилась в г.Тихвин Ленинградской области. Занималась одиночным катанием, выполнила разряд КМС. " +
        "Закончила аспирантуру и защитила диссертацию в НГУ им. П.Ф. Лесгафта, кандидат педагогических наук. " +
        "Начиная с сезона 2006-2007 гг., работает тренером. Ученики Евгении Васильевны в течение многих лет показывают стабильно высокий, качественный результат в региональных и школьных соревнованиях. " +
        "Начиная с сезона 2022-2023 гг., в команде спортивной школы «Голден Айс».\n" +
        "Е.В.Петрова имеет большой положительный опыт в судействе по фигурному катанию, главный судья региональных и всероссийских соревнований. Спортивный судья всероссийской категории. ",
    ],
  },
  "Сагутдинов Юрий Романович": {
    active: true,
    lead: true,
    name: "Сагутдинов Юрий Романович",
    shortname: "Сагутдинов Ю.Р.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3533-3831-4565-b932-313434633639/photo.png",
    contacts: [null, null],
    arenas: ["Репино", "Шанс"],
    description: [
      "Родился во Владимире, занимался одиночным катанием. Победитель зонального первенства ЦФО по старшему возрасту 2018 года. Мастер спорта России. " +
        "Владел прыжком тройной аксель, регулярно получал высокие оценки качества исполнения тройного акселя и каскадов с ним на соревнованиях. " +
        "Начиная с сезона 2020-2021 гг., работает тренером в спортивной школе «Голден Айс». " +
        "Ученики Юрия Романовича выполняют юношеские и спортивные разряды, выигрывают медали в крупнейших соревнованиях города и области.",
    ],
  },
  "Серебряникова Анастасия Андреевна": {
    active: true,
    lead: true,
    name: "Серебряникова Анастасия Андреевна",
    shortname: "Серебряникова А.А.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3164-6638-4238-b965-333630653739/photo.png",
    contacts: [null, null],
    arenas: ["Репино", "Рубеж"],
    description: [
      "Родилась в Твери. Занималась одиночным катанием, выполнила разряд КМС. Выступала по мастерам спорта, победитель и призёр всероссийских соревнований. " +
        "Начиная с сезона 2018-2019 гг., работает тренером в школе «Голден Айс». Ученики Анастасии Андреевны показывают высокое качество заложенных навыков, стабильно выполняют нормы и разряды, развиваются в фигурном катании. " +
        "Технический специалист одиночного катания.",
    ],
  },
  "Серова Анна Сергеевна": {
    active: true,
    lead: true,
    name: "Серова Анна Сергеевна",
    shortname: "Серова А.С.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild6132-3532-4837-b436-313762356436/photo.png",
    contacts: ["+7 (911) 753 53-00", "annaserova007@mail.ru"],
    arenas: ["Красная звезда"],
    description: [
      "Родилась в г.Первоуральск Свердловской области. Занималась одиночным и синхронным катанием в Екатеринбурге.\n\nВ сезонах с 2006-2007 по 2009-2010 гг. – в составе петербургской команды синхронного катания «Парадиз», основном составе сборной команды России по фигурному катанию – трёхкратная чемпионка России, многократный победитель и призёр международных соревнований. Мастер спорта России.\n\nНачиная с сезона 2014-2015 гг., работает тренером в Санкт-Петербурге, с сезона 2022-2023 гг. – в спортивной школе «Голден Айс». Ученики Анны Сергеевны показывают высокий уровень подготовки на соревнованиях, выполняют юношеские и спортивные разряды.",
    ],
  },
  "Чернова Регина Алмазовна": {
    active: true,
    lead: true,
    name: "Чернова Регина Алмазовна",
    shortname: "Чернова Р.А.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild6534-6638-4235-a562-376363353762/photo.png",
    contacts: [null, null],
    arenas: ["Рубеж", "Стрельна"],
    description: [
      "Родилась в Казани, занималась одиночным и синхронным катанием.\n\nВ составе команды «Татарстан» – многократный серебряный призёр чемпионатов России, победитель и призёр всероссийских и международных соревнований, участница чемпионата Мира. Мастер спорта России.\n\nВ сезонах с 2012-2013 по 2016-2017 гг. работала тренером в Казани.\n\nНачиная с сезона 2017-2018 гг., работает в Санкт-Петербурге в школе «Голден Айс». Ученики Регины Алмазовны постоянно представлены в сборной команде школы, побеждают и занимают призовые места в лучших и наиболее значимых соревнованиях города.",
    ],
  },
  "Агафонова Анна Федоровна": {
    active: true,
    lead: false,
    name: "Агафонова Анна Федоровна",
    shortname: "Агафонова А.Ф.",
    position: "Наши тренеры",
    post: null,
    photo: "",
    contacts: [null, null],
    arenas: [""],
    description: [
      "Родилась в Великом Новгороде, занималась одиночным катанием, выполнила разряд КМС",
      "В сезонах 2017-2018 и 2018-2019 гг. работала тренером в Великом Новгороде.",
      "Начиная с сезона 2024-2025 гг., работает тренером в спортивной школе «Голден Айс».",
    ],
  },
  "Калашникова Наталья Александровна": {
    active: true,
    lead: false,
    name: "Калашникова Наталья Александровна",
    shortname: "Калашникова Н.А.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild6163-6238-4165-a633-336530623532/_1.png",
    contacts: [null, null],
    arenas: ["Репино", "Шанс"],
    description: [
      "Родилась в Санкт-Петербурге, занималась одиночным и синхронным катанием. " +
        "Победитель первенства России 2014 года в составе команды «Санрайз-2», капитан команды. Многократный победитель и призёр всероссийских и международных соревнований. Выполнила разряд КМС. " +
        "Начиная с сезона 2017-2018 гг., работает тренером. Начиная с сезона 2021-2022 гг. – в школе «Голден Айс».",
    ],
  },
  "Борисова Светлана Николаевна": {
    active: true,
    lead: false,
    name: "Борисова Светлана Николаевна",
    shortname: "Борисова С.Н.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://static.tildacdn.com/tild6436-6163-4538-b939-303139313836/photo.png",
    contacts: ["+7 (965) 081 92-38", "s_borisova85@bk.ru"],
    arenas: ["Каток в Петергофе"],
    description: [
      "Занималась одиночным катанием, многократный призёр первенств и чемпионатов Санкт-Петербурга и Ленинградской области. Выполнила разряд КМС.\nНачиная с сезона 2016-2017 гг., работает тренером. Начиная с сезона 2023-2024 гг. – в спортивной школе «Голден Айс». Ученики Светланы Николаевны выполняют юношеские разряды, успешно участвуют в соревнованиях.",
    ],
  },
  "Вершинина Виктория Владимировна": {
    active: true,
    lead: false,
    name: "Вершинина Виктория Владимировна",
    shortname: "Вершинина В.В.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3438-3765-4932-b934-313063323034/_1.png",
    contacts: [null, null],
    arenas: ["Шанс"],
    description: [
      "Занималась одиночным катанием, победитель первенства Ленинградской области. Призёр и участник этапов Кубка России, участник финала Кубка России. Выполнила разряд КМС.\n\nНачиная с сезона 2010-2011 гг., работает тренером в Санкт-Петербурге.",
    ],
  },
  "Волкова Софья Александровна": {
    active: true,
    lead: false,
    name: "Волкова Софья Александровна",
    shortname: "Волкова С.А.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://static.tildacdn.com/tild6565-3933-4930-b336-303239306139/photo.png",
    contacts: ["+7 (999) 294 89-52", "sofya.volkova.04@list.ru"],
    arenas: ["Каток в Петергофе"],
    description: [
      "Родилась в г.Кондопога Республики Карелия, занималась одиночным катанием, выполнила разряд КМС. Победитель и призёр региональных соревнований.\n" +
        "Начиная с сезона 2024-2025 гг., работает тренером в спортивной школе «Голден Айс».",
    ],
  },
  "Галкин Роман Сергеевич": {
    active: true,
    lead: false,
    name: "Галкин Роман Сергеевич",
    shortname: "Галкин Р.С.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild6661-3762-4433-b739-383166373462/_1.png",
    contacts: [null, null],
    arenas: ["Стрельна", "Каток в Петергофе"],
    description: [
      "Родился в г. Киров, занимался одиночным катанием, представлял Кировскую область и Санкт-Петербург на основных всероссийских соревнованиях.\n\nУчастник Первенств России по младшему возрасту 2006 и 2008 гг., Первенств России по старшему возрасту 2010, 2011, 2012 гг., этапов Кубка России и Чемпионата России 2015 года.  Владел прыжком тройной аксель, многократно успешно исполнял его на соревнованиях. Мастер спорта России.\n\nНачиная с сезона 2019-2020 гг., работает тренером в Санкт-Петербурге, с сезона 2023?-2024 гг. – в спортивной школе «Голден Айс».",
    ],
  },
  "Глазкова Александра Олеговна": {
    active: true,
    lead: false,
    name: "Глазкова Александра Олеговна",
    shortname: "Глазкова А.О.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3134-3633-4235-b463-656535393031/_1.png",
    contacts: [null, null],
    arenas: ["Рубеж"],
    description: [
      "Родилась в Челябинске. Занималась одиночным и синхронным катанием, выполнила разряд КМС.\n\nВ составе московской команды «Кристалл Айс Джуниор» – серебряный призёр первенства России среди юниоров 2018 года, бронзовый призёр чемпионата мира среди юниоров 2018 года.\n\nС 2019 года работает тренером, начиная с сезона 2021-2022 гг. – в Санкт-Петербурге, в школе «Голден Айс».",
    ],
  },
  "Доронина Алена Игоревна": {
    active: true,
    lead: false,
    name: "Доронина Алена Игоревна",
    shortname: "Доронина А.И.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3962-6462-4064-a634-356537353363/_.png",
    contacts: [null, null],
    arenas: ["Репино", "Шанс", "Красная звезда"],
    description: [
      "Занималась одиночным катанием в Нижнем Новгороде. Многократный призёр межрегиональных и всероссийских соревнований. Выполнила разряд КМС.\nНачиная с сезона 2021-2022 гг., работает тренером. Начиная с сезона 2023-2024 гг. – в спортивной школе «Голден Айс». Ученики Алены Игоревны выполняют юношеские разряды, входят в сборную команду школы.",
    ],
  },
  "Доронина Светлана Игоревна": {
    active: true,
    lead: false,
    name: "Доронина Светлана Игоревна",
    shortname: "Доронина С.И.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3766-3465-4135-a563-303238343734/_.png",
    contacts: [null, null],
    arenas: ["Шанс", "Красная звезда"],
    description: [
      "Занималась одиночным катанием в Нижнем Новгороде. Победитель и призёр региональных соревнований. Выполнила разряд КМС.\n\nВ сезонах с 2018-2019 по 2020-2021 гг. работала тренером в п.Красные Баки Нижегородской области.\n\nНачиная с сезона 2021-2022 гг., работает тренером в Санкт-Петербурге, в школе «Голден Айс».",
    ],
  },
  "Жужгина Александра Викторовна": {
    active: true,
    lead: false,
    name: "Жужгина Александра Викторовна",
    shortname: "Жужгина А.В.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://static.tildacdn.com/tild3365-6264-4139-b964-303438383166/photo.png",
    contacts: [null, null],
    arenas: ["Шуваловский лед"],
    description: [
      "Родилась в г.Тюмень, занималась одиночным катанием, выполнила разряд КМС. Победитель и призёр региональных соревнований, участница этапов Кубка России.\n" +
        "Начиная с сезона 2024-2025 гг., работает тренером в спортивной школе «Голден Айс».",
    ],
  },
  "Занина Анна Игоревна": {
    active: true,
    lead: false,
    name: "Занина Анна Игоревна",
    shortname: "Занина А.И.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://static.tildacdn.com/tild3437-6433-4036-b332-343738356433/photo.png",
    contacts: ["+7 (981) 853-71-96", "annazanina310502@gmail.com"],
    arenas: ["Ракета"],
    description: [
      "Занималась одиночным катанием в Якутске, многократный призёр региональных соревнований. Выполнила разряд КМС.\n\nНачиная с сезона 2018-2019 гг., работает тренером. Начиная с сезона 2022-2023 гг. – в спортивной школе «Голден Айс». Под руководством Анны Игоревны юные спортсмены успешно накапливают тренировочный и соревновательный опыт.",
    ],
  },
  "Казанцева Виктория Владимировна": {
    active: true,
    lead: false,
    name: "Казанцева Виктория Владимировна",
    shortname: "Казанцева В.В.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild6135-3632-4438-a166-633131626164/_1.png",
    contacts: [null, null],
    arenas: ["Стрельна"],
    description: [
      "Занималась одиночным и парным катанием в Санкт-Петербурге. Серебряный призёр первенства России по младшему возрасту 2003 года.\n\nВ парном катании – член юниорской сборной команды России в сезоне 2005-2006 гг., участница юниорского чемпионата мира. Победитель и призёр всероссийских соревнований, выполнила норму мастера спорта.\n\nПосле окончания спортивной карьеры приступила к тренерской работе в Санкт-Петербурге. В.В.Казанцева зарекомендовала себя как самый результативный детский тренер города: разные её ученики регулярно побеждают в турнирах с максимально конкурентным составом участников",
    ],
  },
  "Катичев Владислав Олегович": {
    active: true,
    lead: false,
    name: "Катичев Владислав Олегович",
    shortname: "Катичев В.О.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://static.tildacdn.com/tild6262-6466-4365-b431-303130376234/photo.png",
    contacts: ["+7 (987) 993 10-50", "v.katichev.2001@gmail.com"],
    arenas: ["Красная звезда"],
    description: [
      "Родился в Саранске, представлял Республику Мордовия и Санкт-Петербург на основных всероссийских соревнованиях. Участник Первенства России по младшему возрасту 2013 года, первенств России по старшему возрасту 2017,2018 годов, участник пяти чемпионатов России (2019-2023 гг.).\n\nВладел элементами ультра-си – тройной аксель, четверной тулуп, четверной сальхов. Победитель и призёр всероссийских соревнований. Мастер спорта России.\n\nНачиная с сезона 2023-2024 гг., работает тренером в спортивной школе «Голден Айс».",
    ],
  },
  "Кочина Анна Андреевна": {
    active: true,
    lead: false,
    name: "Кочина Анна Андреевна",
    shortname: "Кочина А.А.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild6161-3862-4036-b364-633336386432/_1.png",
    contacts: [null, null],
    arenas: ["Репино", "Шанс"],
    description: [
      "Призёр чемпионата России по современным танцевальным направлениям. " +
        "Начиная с сезона 2013-2014 гг., работает тренером. Начиная с сезона 2020-2021 гг. – в школе «Голден Айс». Ученики Анны Андреевны успешно выступают на престижных соревнованиях различного уровня, выполняют нормы юношеских и спортивных разрядов. ",
    ],
  },
  "Мушанова Екатерина Анатольевна": {
    active: true,
    lead: false,
    name: "Мушанова Екатерина Анатольевна",
    shortname: "Мушанова Е.А.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3831-3062-4365-a630-343636333563/photo.png",
    contacts: [null, null],
    arenas: ["Рубеж"],
    description: [
      "Родилась в Москве. Занималась одиночным катанием в г. Севастополь.\n\nПобедитель и призёр республиканских и международных детских соревнований.\n\nВ сезонах 2017-2018 и 2018-2019 гг. работала тренером в г. Севастополь.\n\nНачиная с сезона 2021-2022 гг., работает тренером в Санкт-Петербурге, в спортивной школе «Голден Айс».",
    ],
  },
  "Назарова Елизавета Александровна": {
    active: true,
    lead: false,
    name: "Назарова Елизавета Александровна",
    shortname: "Назарова Е.А.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3366-6139-4566-b132-663038653834/photo.png",
    contacts: ["+7 (911) 826-39-66", "89236058663@mail.ru"],
    arenas: ["Академия В. Харламова", "Ракета"],
    description: [
      "Занималась одиночным катанием в г.Белово Кемеровской области, победитель и призёр региональных соревнований, выполнила разряд КМС.\n\nВ сезонах 2014-2015 и 2015-2016 гг. работала тренером в г.Белово.\n\nНачиная с сезона 2017-2018 гг., работает тренером в Санкт-Петербурге, в школе «Голден Айс». Ученики Елизаветы Александровны выступают на детских соревнованиях, выполняют норму юного фигуриста и юношеские разряды.",
    ],
  },
//   "Никитина Дарья Александровна": {
//     active: true,
//     lead: false,
//     name: "Никитина Дарья Александровна",
//     shortname: "Никитина Д.А.",
//     position: "Наши тренеры",
//     post: null,
//     photo:
//       "https://static.tildacdn.com/tild6161-3161-4639-b737-656236643164/photo.png",
//     contacts: [null, null],
//     arenas: ["Шуваловский лед"],
//     description: [
//       "Родилась в г.Гомель Республики Беларусь, занималась одиночным катанием.\n" +
//         "Начиная с сезона 2021-2022 гг. – работала тренером в Минске. Начиная с сезона 2024-2025 гг., – в спортивной школе «Голден Айс».",
//     ],
//   },
  "Онищенко Светлана Александровна": {
    active: true,
    lead: false,
    name: "Онищенко Светлана Александровна",
    shortname: "Онищенко С.А.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://static.tildacdn.com/tild6338-3961-4635-a135-653831656633/photo.png",
    contacts: ["+7 (981) 764 34-95", "Svetlashafs@mail.ru"],
    arenas: ["Стрельна"],
    description: [
      "Занималась одиночным катанием в Санкт-Петербурге. Многократный призёр региональных и международных детских соревнований. Выполнила разряд КМС.\nНачиная с сезона 2018-2019 гг., работает тренером. Начиная с сезона 2023-2024 гг. – в спортивной школе «Голден Айс». Ученики Светланы Александровны активно осваивают навыки фигурного катания, успешно участвуют в соревнованиях для юных спортсменов.",
    ],
  },
  "Селезенева Кристина Андреевна": {
    active: true,
    lead: false,
    name: "Селезенева Кристина Андреевна",
    shortname: "Селезенева К.А.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://static.tildacdn.com/tild3162-3734-4133-b532-396661666465/photo.png",
    contacts: [null, null],
    arenas: ["Рубеж"],
    description: [
      "Родилась в г. Перми, занималась одиночным и синхронным катанием. Представляла Пермский край на основных всероссийских соревнованиях, участница четырёх чемпионатов России. Мастер спорта России.\n\nНачиная с сезона 2021-2022 гг., работает тренером. Начиная с сезона 2023-2024 гг. — в спортивной школе «Голден Айс».",
    ],
  },
  "Сластина Екатерина Львовна": {
    active: true,
    lead: false,
    name: "Сластина Екатерина Львовна",
    shortname: "Сластина Е.Л.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://static.tildacdn.com/tild3761-6562-4239-b463-353433633830/photo.png",
    contacts: [null, null],
    arenas: ["Шуваловский лед"],
    description: [
      "Родилась в Нижнем Новгороде, занималась одиночным катанием. Представляла Нижегородскую область на межрегиональных и всероссийских соревнованиях. Выполнила разряд КМС.\n" +
        "Начиная с сезона 2022-2023 гг., работает тренером в спортивной школе «Голден Айс».",
    ],
  },
  "Сорокина Елизавета Андреевна": {
    active: true,
    lead: false,
    name: "Сорокина Елизавета Андреевна",
    shortname: "Сорокина Е.А.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild6236-3339-4936-b264-316237333434/photo.png",
    contacts: ["+7 (932) 305 55-37", "s-elizabet@mail.ru"],
    arenas: ["Стрельна"],
    description: [
      "Занималась одиночным и синхронным катанием в Челябинске, участница первенств и чемпионатов России в синхронном катании. Выполнила разряд КМС.\n\nНачиная с сезона 2022-2023 гг., работает тренером в спортивной школе «Голден Айс». Под руководством Елизаветы Андреевны юные спортсмены успешно накапливают тренировочный и соревновательный опыт.",
    ],
  },
  "Серебряникова Елизавета Андреевна": {
    active: true,
    lead: false,
    name: "Серебряникова Елизавета Андреевна",
    shortname: "Серебряникова Е.А.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3239-3861-4732-b664-393137373432/photo.png",
    contacts: [],
    arenas: ["Репино", "Рубеж"],
    description: [
      "Родилась в Твери. Занималась одиночным катанием, выполнила разряд КМС. Призёр региональных соревнований.\n" +
        "В сезонах 2022-2023, 2023-2024 гг. работала тренером в Твери.\n" +
        "Начиная с сезона 2024-2025 гг., работает тренером в школе «Голден Айс».",
    ],
  },
  "Попова Елизавета Алексеевна": {
    active: true,
    lead: false,
    name: "Попова Елизавета Алексеевна",
    shortname: "Попова Е.А.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild6466-3165-4431-b066-386562333965/photo.png",
    contacts: [],
    arenas: [],
    description: [],
  },
  "Вязина Екатерина Антоновна": {
    active: true,
    lead: false,
    name: "Вязина Екатерина Антоновна",
    shortname: "Вязина Е.А.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3766-3361-4233-a563-616632663537/photo.png",
    contacts: [],
    arenas: [],
    description: [],
  },
  "Степаньков Никита Вадимович": {
    active: true,
    lead: false,
    name: "Степаньков Никита Вадимович",
    shortname: "Степаньков Н.В.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://static.tildacdn.com/tild3531-6661-4762-b161-373539316365/photo.png",
    contacts: ["+7 (993) 480 56-20", "nikitastepankov42@gmail.com"],
    arenas: [""],
    description: [""],
  },
  "Сысцова Марина Сергеевна": {
    active: true,
    lead: false,
    name: "Сысцова Марина Сергеевна",
    shortname: "Сысцова М.С.",
    position: "Руководители школы",
    post: "РУКОВОДИТЕЛЬ ШКОЛЫ. МАСТЕР СПОРТА МЕЖДУНАРОДНОГО КЛАССА",
    photo:
      "https://thumb.tildacdn.com/tild3831-3831-4935-b935-613335613039/photo.png",
    contacts: [null, null],
    arenas: [""],
    description: [
      "Родилась 10 апреля 1991 года в Челябинске. Занималась одиночным, парным и синхронным катанием. Участница первенства России по младшему возрасту 2003 года.\n\nВ сезонах с 2008-2009 по 2013-2014 и сезоне 2015-2016 гг. – в составе петербургской команды синхронного катания «Парадиз», основном составе сборной России по фигурному катанию – семикратная чемпионка России, чемпионка мира 2016 года. Мастер спорта России международного класса.\n\nВ августе 2016 года Марина Сысцова совместно с Анастасией Юрченко открыла в Санкт-Петербурге частную спортивную школу фигурного катания «Голден Айс», а в январе 2022 года – бюджетное отделение школы.",
    ],
  },
  "Талалайкина Мария Сергеевна": {
    active: true,
    lead: false,
    name: "Талалайкина Мария Сергеевна",
    shortname: "Талалайкина М.С.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://static.tildacdn.com/tild6338-3363-4437-b030-613532363133/photo.png",
    contacts: [null, null],
    arenas: ["Шуваловский лед"],
    description: [
      "Родилась в Челябинске, представляла Санкт-Петербург на основных всероссийских соревнованиях, участница четырёх чемпионатов России (2018,2020,2022,2024 гг.). Владела различными каскадами из двух тройных прыжков. Многократный призёр всероссийских соревнований, призёр международных соревнований. Мастер спорта России. Начиная с сезона 2023-2024 гг., работает тренером в спортивной школе «Голден Айс».",
    ],
  },
  "Тырлова Татьяна Александровна": {
    active: true,
    lead: false,
    name: "Тырлова Татьяна Александровна",
    shortname: "Тырлова Т.А.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://static.tildacdn.com/tild6535-3666-4538-b736-313564643764/photo.png",
    contacts: ["+7 (911) 100 21-86", "taniahju@mail.ru"],
    arenas: ["Красная звезда"],
    description: [
      "Родилась в г.Гатчина Ленинградской области, занималась одиночным и парным катанием, представляла Санкт-Петербург и Ленинградскую область на основных всероссийских соревнованиях. Серебряный призёр Первенства России по младшему возрасту 2004 года. Выполнила разряд КМС.\n" +
        "Начиная с сезона 2015-2016 гг. – работает тренером в Санкт-Петербурге и Ленинградской области. Начиная с сезона 2023-2024 гг., – в спортивной школе «Голден Айс».",
    ],
  },
  "Устинов Александр Владимирович": {
    active: true,
    lead: false,
    name: "Устинов Александр Владимирович",
    shortname: "Устинов А.В.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3865-3830-4439-a535-323861366662/photo.png",
    contacts: [null, null],
    arenas: ["Каток в Петергофе"],
    description: [
      "Родился в г. Новосибирск, занимался одиночным катанием, представлял Новосибирскую область и Пермский край на республиканских соревнованиях. Мастер спорта России.\n\nНачиная с сезона 2011-2012 гг., работает тренером. Успешно работал со спортсменами разной квалификации, от младших спортивных разрядов до уровня мастеров спорта.\n\nНачиная с сезона 2024-2025 гг., работает тренером в спортивной школе «Голден Айс». \n\n  \n",
    ],
  },
  "Филёва Анастасия Павловна": {
    active: true,
    lead: false,
    name: "Филёва Анастасия Павловна",
    shortname: "Филёва А.П.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild6630-3961-4632-b834-343966636462/photo.png",
    contacts: ["+7 (919) 498-80-10", "nastyafileva@bk.ru"],
    arenas: ["Ракета"],
    description: [
      "Родилась в г. Ухта Республики Коми, представляла Республику Коми в одиночном катании, Пермский край в парном и синхронном катании, участница Чемпионата России по синхронному катанию 2021 года. \nМастер спорта России. Начиная с сезона 2023-2024 гг., работает тренером в спортивной школе «Голден Айс».",
    ],
  },
  "Хрястова Ирина Сергеевна": {
    active: true,
    lead: false,
    name: "Хрястова Ирина Сергеевна",
    shortname: "Хрястова И.С.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3438-6139-4330-b432-643638336562/photo.png",
    contacts: [null, null],
    arenas: ["Красная звезда"],
    description: [
      "Родилась в г.Тихвин Ленинградской области. Занималась одиночным катанием, выполнила разряд КМС. Победитель и призёр региональных соревнований. Благодарность Комитета по культуре, спорту и молодёжной политике Ленинградской области.\n\nНачиная с сезона 2015-2016 гг., работает тренером в Санкт-Петербурге, с сезона 2022-2023 гг. – в спортивной школе «Голден Айс». Ученики Ирины Сергеевны активно участвуют в соревнованиях, выполняют юношеские разряды.",
    ],
  },
  "Цвелиховский Виктор Вадимович": {
    active: true,
    lead: false,
    name: "Цвелиховский Виктор Вадимович",
    shortname: "Цвелиховский В.В.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3832-3762-4332-b764-613236653533/photo.png",
    contacts: ["+7 (981) 720-61-62", "zero03@mail.ru"],
    arenas: ["Репино", "Красная звезда", "Академия В. Харламова", "Ракета"],
    description: [
      "Родился в Казахстане, в г.Жамбыл. " +
        "Занимался одиночным катанием и танцами на льду в Санкт-Петербурге. Участник первенств России по младшему возрасту 2003 и 2004 годов. Победитель и призёр региональных соревнований, участник этапов Кубка России, выполнил разряд КМС. " +
        "В сезонах с 2012-2013 по 2015-2016 гг. работал в Санкт-Петербурге тренером по скольжению. " +
        "В сезонах с 2016-2017 по 2019-2020 гг. – участник международных ледовых шоу. " +
        "Начиная с сезона 2021-2022 гг., работает тренером в школе «Голден Айс».",
    ],
  },
  "Цепенкова Ксения Михайловна": {
    active: true,
    lead: false,
    name: "Цепенкова Ксения Михайловна",
    shortname: "Цепенкова К.М.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://static.tildacdn.com/tild3638-6330-4132-a533-666437393234/photo.png",
    contacts: [null, null],
    arenas: ["Шуваловский лед"],
    description: [
      "Родилась в Ленинграде, занималась одиночным катанием, лидер сборной команды Ленинградской области в 2005 и 2006 годах.\n\n\n\nВладела всеми прыжками в три оборота. Призёр этапов и финала Кубка России, международных соревнований. Мастер спорта России.\n\n\n\nНачиная с сезона 2016-2017 гг., работает тренером. Начиная с сезона 2024-2025 гг. – в спортивной школе «Голден Айс**».**",
    ],
  },
  "Шишкина Полина Станиславовна": {
    active: true,
    lead: false,
    name: "Шишкина Полина Станиславовна",
    shortname: "Шишкина П.С.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://thumb.tildacdn.com/tild3332-3339-4264-b035-393833323866/photo.png",
    contacts: [null, null],
    arenas: ["Лед-3"],
    description: [
      "Родилась в Екатеринбурге, занималась одиночным катанием, выполнила разряд КМС.\n\nВ сезонах 2018-2019 и 2019-2020 гг. работала тренером в Екатеринбурге.\n\nНачиная с сезона 2020-2021 гг., работает тренером в Санкт-Петербурге, в школе «Голден Айс».",
    ],
  },
  "Юрченко Анастасия Ивановна": {
    active: true,
    lead: false,
    name: "Юрченко Анастасия Ивановна",
    shortname: "Юрченко А.И.",
    position: "Руководители школы",
    post: "ДИРЕКТОР. ЗАСЛУЖЕННЫЙ МАСТЕР СПОРТА РОССИИ",
    photo:
      "https://thumb.tildacdn.com/tild3766-3362-4233-a562-313930303662/photo.png",
    contacts: [null, null],
    arenas: [""],
    description: [
      "Родилась 6 февраля 1993 года в г.Ухта Республики Коми. Занималась одиночным и синхронным катанием, участвовала в Первенстве России младшего возраста 2004 года.\n\nВ сезонах с 2009-2010 по 2015-2016 гг. – в составе петербургской команды синхронного катания «Парадиз», основном составе сборной России по фигурному катанию. В этот период «Парадиз» – бессменный чемпион России, впервые выиграл малые золотые медали за короткую программу на чемпионате мира 2012 года, медали по итогам чемпионата мира – в 2015 году. В сезоне 2015-2016 гг. Анастасия Юрченко – капитан команды. В декабре 2015 года «Парадиз» выиграл Финал Гран-при по фигурному катанию, а в апреле 2016 года российская команда одержала первую победу на чемпионатах мира по синхронному катанию.\n\nВ августе 2016 года Анастасия Юрченко совместно с Мариной Сысцовой открыла в Санкт-Петербурге школу фигурного катания «Голден Айс».\n\nВ сезонах с 2016-2017 по 2021-2022 гг. работала тренером, подготовила свою ученицу, Алису Гориславскую, к участию в Первенстве России младшего возраста 2022 года.\n\nС августа 2018 года – Директор частной спортивной школы «Голден Айс».",
    ],
  },
  "<не определен>": {
    active: false,
    lead: false,
    name: "<не определен>",
    shortname: "<не о.",
    position: "Наши тренеры",
    post: null,
    photo:
      "https://codahosted.io/docs/tHfdwb1AeV/blobs/bl-K9eGJG_KTt/24eb46b7522ee7160729e7b0d748c9b5eb78af1f97036e7213e356ffb5558171ef1b861972fb21e0254723bdea39deb99ab4f02e43f9259c888c67041969640fb7f0a8c8013dace941439a6a5491de3198836a723ebd99697c7e1d3e3c36d9385795177a",
    contacts: [null, null],
    arenas: [""],
    description: [""],
  },
};
const coachesSection = document.querySelector("#coaches");

let maxPersonCount = 8;
const showAll = (button) => {
  switch (button.getAttribute("data-status")) {
    case "hidden":
      button.innerHTML = "Скрыть";
      button.setAttribute("data-status", "visible");
      document.querySelectorAll('[data-spoiler="true"]').forEach((el, ind) => {
        el.style.display = "flex";
        if (ind === 1) {
          el.scrollIntoView({ behavior: "smooth" });
        }
      });
      break;
    case "visible":
      button.setAttribute("data-status", "hidden");
      button.innerHTML = "Показать всех";
      document.querySelectorAll('[data-spoiler="true"]').forEach((el, ind) => {
        el.style.display = "none";
      });
  }
};
const openCloseCoachInfo = () => {
  if (document.getElementById("coachInfo")) {
    document.getElementById("coachInfo").remove();
    document.getElementById("closeCoachInfo").remove();
  }
};
const coachInfo = (coachEl) => {
  const name = coachEl.getAttribute("data-person");
  const photo = coaches[name].photo;
  const post = coaches[name].post;
  const arenas = coaches[name].arenas;
  const description = coaches[name].description;
  const phone = coaches[name].contacts[0];
  const email = coaches[name].contacts[1];

  document.body.insertAdjacentHTML(
    "afterbegin",
    `<section id="coachInfo"></section>`
  );
  document
    .getElementById("coachInfo")
    .insertAdjacentHTML("beforeend", `<article></article>`);
  document.body.insertAdjacentHTML(
    "afterbegin",
    `<svg onclick="openCloseCoachInfo()" id="closeCoachInfo" width="40" height="40" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><g stroke-width="0"/><g stroke-linecap="round" stroke-linejoin="round"/><path fill-rule="evenodd" clip-rule="evenodd" d="M1.25 7.25a6 6 0 0 1 6-6h9.5a6 6 0 0 1 6 6v9.5a6 6 0 0 1-6 6h-9.5a6 6 0 0 1-6-6zm5.933-.067a.625.625 0 0 1 .884 0L12 11.117l3.934-3.934a.625.625 0 1 1 .883.884L12.883 12l3.934 3.934a.625.625 0 1 1-.883.883L12 12.883l-3.934 3.934a.625.625 0 1 1-.883-.883L11.117 12 7.183 8.067a.625.625 0 0 1 0-.884" fill="#232323"/></svg>`
  );

  const section = document.getElementById("coachInfo");
  const inTo = document.querySelector("#coachInfo > article");
  inTo.insertAdjacentHTML("beforeend", `<img src="${photo}">`);
  inTo.insertAdjacentHTML("beforeend", `<h5>${name}</h5>`);
  post ? inTo.insertAdjacentHTML("beforeend", `<h4>${post}</h4>`) : "";
  arenas[0].length > 2
    ? inTo.insertAdjacentHTML(
        "beforeend",
        `<div id="coachArenas"><h6>Преподает на аренах: </h6><p>${arenas}</p></div>`
      )
    : "";
  inTo.insertAdjacentHTML("beforeend", `<p>${description}</p>`);
  inTo.insertAdjacentHTML(
    "beforeend",
    `<div id="coachButtons">
        <a href="#popup:freeFirstLesson">Записаться</a>
        ${phone ? `<a href="tel:${phone}">Позвонить</a>` : ""}
        ${email ? `<a href="mailto:${email}">Написать письмо</a>` : ""}
        </div>`
  );
};
const addPerson = (person, position) => {
  if (!document.querySelector(`[data-position="${position}"]`)) {
    coachesSection.insertAdjacentHTML(
      "afterbegin",
      `<h2 class="addSplash">${position}</h2><section data-person-counter="-1" data-position="${position}"></section>`
    );
  }
  const pasteTo = document.querySelector(`[data-position="${position}"]`);

  let isNumber = pasteTo.getAttribute("data-person-counter");
  isNumber++;
  pasteTo.setAttribute("data-person-counter", isNumber++);

  if (isNumber > maxPersonCount && !pasteTo.querySelector(".showAppButton")) {
    pasteTo.insertAdjacentHTML(
      "beforeend",
      `<div data-status="hidden" onclick="showAll(this)" class="showAppButton">Посмотреть всех</div>`
    );
  }

  pasteTo.insertAdjacentHTML(
    "beforeend",
    `
        <article ${
          isNumber > maxPersonCount
            ? ' style="display:none" data-spoiler="true" '
            : ""
        } onclick="coachInfo(this)" data-person="${person.name}">
            <img src="${person.photo}" alt="">
            <div class="personInfo">
                <h4>${person.name}</h4>
            </div>
        </article>
    `
  );
};
for (const coach of Object.values(coaches)) {
  if (coach.active) {
    addPerson(coach, coach.position);
  }
}